app/controllers/products_controller.rb

  def index
		if params[:c].present?
    	@products = Product.includes(:categories, :product_categories).where(:categories => { :id => params[:c] })
		else
			@products = Product.includes(:categories, :product_categories)
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (3, 4, 2)
SELECT "product_categories".* FROM "product_categories" WHERE "product_categories"."product_id" = ?  [["product_id", 1]]
SELECT "products".* FROM "products" WHERE (product_categories.category_id = NULL)
SELECT "products".* FROM "products" WHERE (category.name =NULL)

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Veg-Rice"], ["description", "Veg-Rice"], ["created_at", "2015-08-01 13:06:22.668987"], ["updated_at", "2015-08-01 13:06:22.668987"]]