app/views/products/_products.html.haml

SELECT "categories"."name", "categories"."id" FROM "categories"
SELECT "product_categories".* FROM "product_categories" WHERE "product_categories"."product_id" = ?  [["product_id", 1]]
SELECT "products".* FROM "products" WHERE (product_categories.category_id = NULL)
---
        %td
          = product.product_categories.collect{|pc| "<a href='/products?c=#{pc.category.id}' data-remote=true>##{pc.category.name}</a>"}.join(", ").html_safe