app/views/products/index.html.haml

  %label Categories:
  = select_tag "c", options_for_select(Category.pluck(:name, :id), params[:c]), :prompt => "Select", :id => "cat-filter"
.table-responsive#table-data
---
SELECT "categories"."name" FROM "categories"